todoList/app/controllers/todo_things_controller.rb

  def index
    @todo_things = TodoThing.all
---
SELECT "todo_things".* FROM "todo_things"

  def create
    @todo_thing = TodoThing.new(todo_thing_params)

    respond_to do |format|
      if @todo_thing.save
---
INSERT INTO "todo_things" ("created_at", "description", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sun, 13 Sep 2015 21:26:10 UTC +00:00], ["description", "Banada"], ["title", "Grocery"], ["updated_at", Sun, 13 Sep 2015 21:26:10 UTC +00:00]]

  def update
    respond_to do |format|
      if @todo_thing.update(todo_thing_params)
---
UPDATE "todo_things" SET "description" = ?, "updated_at" = ? WHERE "todo_things"."id" = 1  [["description", "Banada asdasdadf"], ["updated_at", Sun, 13 Sep 2015 21:27:25 UTC +00:00]]

  def destroy
    @todo_thing.destroy
---
DELETE FROM "todo_things" WHERE "todo_things"."id" = ?  [["id", 2]]

    def set_todo_thing
      @todo_thing = TodoThing.find(params[:id])
---
SELECT "todo_things".* FROM "todo_things" WHERE "todo_things"."id" = ? LIMIT 1  [["id", "2"]]